#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=533ec21e31d1ed247c2698480a2af206ed5cc013]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YzU3MzIzYy0zZDc4LTQyNmYtYjY3Ny1mYjE3MDA3NzBjNzM7b2JqZWN0SWQ9ZTkyMDA1NGItY2Y0ZS00NjBmLTliMmQtYmE2ODA5OTRmNGVhO3N1YnNjcmlwdGlvbklkPWNiNWIwNzdjLTNlZjUtNGIyZS04M2U1LTQ5MGNjNWNhMGUxOTt0ZW5hbnRJZD0xNmIzYzAxMy1kMzAwLTQ2OGQtYWM2NC03ZWRhMDgyMGI2ZDM=]
data.azurerm_resource_group.example: Read complete after 1s [id=/subscriptions/cb5b077c-3ef5-4b2e-83e5-490cc5ca0e19/resourceGroups/OA-20230705-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/cb5b077c-3ef5-4b2e-83e5-490cc5ca0e19/resourceGroups/OA-20230705-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/cb5b077c-3ef5-4b2e-83e5-490cc5ca0e19/resourceGroups/OA-20230705-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/cb5b077c-3ef5-4b2e-83e5-490cc5ca0e19/resourceGroups/OA-20230705-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/cb5b077c-3ef5-4b2e-83e5-490cc5ca0e19/resourceGroups/OA-20230705-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/cb5b077c-3ef5-4b2e-83e5-490cc5ca0e19/resourceGroups/OA-20230705-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "pr-machine" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "7d9507d6-9b0d-4413-b9fc-ea4dcc72ea2d" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_c14a461394884ee5b24e9a81e56e5246" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @oreakinodidi98, Action: `pull_request`*